#pragma once
#ifndef PALETTE_H_
#define PALETTE_H_

#include "source.h"

//================================================
// 概要：カラーパレットの色と場所
//================================================
typedef struct {
	int R, G, B;
	POS POS;
} PALETTE;

//================================================
// 概要：カラーパレットの表示
// 引数：index 表示する色
//================================================
void DrawPalette(int index);

//================================================
// 概要：カラーパレットから色を選択する
// 引数：*index 変更する色
//================================================
void SelectColor(int* index);

//================================================
// 概要：ダブルクリックされたか、チェックする
//================================================
void CheckDoubleClick(void);

//================================================
// 概要：カラーパレットの色
//================================================
extern PALETTE ColorTB[];

#endif // PALETTE_H_